# Builded with util/parse.py

define char_chapter1_day1_sasha_start_0 = Character("Саша")
define char_chapter1_day1_sasha_start_1 = Character("ГГ")

label chapter1_day1_sasha_start:
    "~ Несколько секунд Саша походила на хамелеона - эмоции на ее лице сменяли друг друга с поразительной скоростью. Когда она наконец остановилась на усталой смиренности, я выдохнул с облегчением: мне удалось избежать наказания за дерзость. ~"
    "~ Саша снова вздохнула, но на этот раз так, словно согласилась на пытку. ~"
    char_chapter1_day1_sasha_start_0 "Просто сделай вид, что тебе нечем заняться и ты альтруист в глубине души, чтобы я не искала иного объяснения твоим поступкам, хорошо?"
    char_chapter1_day1_sasha_start_1 "Уи, мон женераль!"
    "~ Саша развернулась и пошагала к дальним рядам сидений, мимо которых мы проходили, когда зашли в помещение коворкинга. ~"
    "~ Если она утверждает, что знает, где оставила некую _вещь_, то этот маневр не имеет никакого смысла. Искать ее следует там, где она задерживалась на долгое время ~"
    char_chapter1_day1_sasha_start_1 "Ты уверена, что потеряла _вещь_ тут, в пределах коворкинга?"
    char_chapter1_day1_sasha_start_0 "Ничего я не теряла! Это… глупое недоразумение."
    char_chapter1_day1_sasha_start_1 "И всё же?"
    char_chapter1_day1_sasha_start_0 "Я не уверена… Обычно мне не приходится задумываться о том, где она находится, потому что она всегда со мной."
    char_chapter1_day1_sasha_start_1 "Но не в этот раз. Думаю, нам стоит начать поиски в другом месте. Учитывая то, что коворкинг был исследован тобой вдоль и поперек… Кстати, а что мы ищем?"
    char_chapter1_day1_sasha_start_0 "Коричневый рюкзачок с белыми застежками."
    char_chapter1_day1_sasha_start_1 "Понятно. Это хорошая новость. Рюкзак не ключи, мы быстро обнаружим его даже с большого…"
    "~ Саша резко перебила меня. ~"
    char_chapter1_day1_sasha_start_0 "Это _плохая_ новость! Как раз потому, что он достаточно крупный, чтобы его можно было найти, быстро осмотрев комнату. Он бы уже давно нашелся…"
    char_chapter1_day1_sasha_start_1 "Хочешь сказать, ты понимаешь, что поиски в коворкинге бессмысленны, поскольку тут пропажа нашлась бы в считанные минуты… но всё равно продолжаешь нарезать круги именно в коворкинге..?"
    "~ Кажется, этим я застал Сашу врасплох. Она молча смотрела под ноги и пыталась придумать причину, почему эта же мысль не посетила ее раньше. ~"
    char_chapter1_day1_sasha_start_1 "Значит, ты согласна с тем, что нам _стоит_ повторить маршрут экскурсии и поискать рюкзак в аудиториях, которые мы успели посетить."
    "~ Гениальный сыщик смущенно кивнула. ~"
    char_chapter1_day1_sasha_start_1 "Тогда идем. Дать ручку, чтобы не потерялась?"
    char_chapter1_day1_sasha_start_0 "Я не…"
    char_chapter1_day1_sasha_start_1 "Шучу ведь."
    "~ Что эти деятели подмешали в чай? ~"
    "~ Мы брели по знакомым коридорам, которые с каждым поворотом становились всё менее знакомыми. ~"
    "~ В какой-то момент начали закрадываться сомнения, что мы всё ещё не сбились с верного пути. На остекленевшую Сашу не было никакой надежды ~"
    "~ Из очередной комнаты, которую пришлось покинуть с пустыми руками, Саша вышла совсем подавленной. Мы даже половины комнат не осмотрели, а она, кажется, уже потеряла всякую надежду на счастливый исход ~"
    "~ Какая-то неестественная реакция. Может, причина в содержимом рюкзака?. ~"
    char_chapter1_day1_sasha_start_0 "Не могу поверить… Я всегда ношу его с собой и за долгие годы ни разу не теряла в общественных местах… Лёша, постой."
    "~ Я остановился и приготовился слушать. ~"
    char_chapter1_day1_sasha_start_0 "Если мы не найдем его в следующей аудитории… Боюсь, мне придется продолжить поиски самостоятельно и уже завтра."
    char_chapter1_day1_sasha_start_0 "    Буду надеяться, что найдется неравнодушный человек, который отнесет пропажу на вахту или что его хотя бы не украдут."
    char_chapter1_day1_sasha_start_1 "Не вижу в этом смысла. У нас осталась куча времени и мест, которые нужно проверить. Ты слишком торопишься раскиснуть окончательно."
    "~ Саша посмотрела на меня с неожиданной строгостью. ~"
    char_chapter1_day1_sasha_start_0 "**Нет.** То есть… прости, дело совсем не в этом. Просто прими как должное - у нас есть время на одну аудиторию. Не больше."
    "~ Конечно, конечно. Солдат не должен думать, за него думает начальство. Начальству ведь виднее - всегда можно ставить бессмысленные условия и держать бойца в неведении. ~"
    char_chapter1_day1_sasha_start_1 "Хорошо, хорошо, дело твое. Какую аудиторию мы проверим последней?"
    char_chapter1_day1_sasha_start_0 "Дай подумать…"
    "~ Саша зависла где-то на минуту, после чего со смущенным видом выдохнула: ~"
    char_chapter1_day1_sasha_start_0 "Я не знаю…"
    "~ Приехали - теперь и начальство не думает. Пришла пора простому рядовому блеснуть своей сообразительностью и спасти ситуацию. ~"
    "~ Где же всё-таки оставило свой рюкзак недоразумение в синем свитере? Я начал вспоминать возможные места в хронологическом порядке. ~"
    "~ Первой на ум пришла “радиоточка” - тут нам впервые предложили присесть и передохнуть перед длительной экскурсией ~"
    "~ Саша могла снять рюкзак - предположим, ей потребовалось достать своё _секретное нечто_ ~"
    "~ В такой ситуации достаточно на минутку переключить внимание на что-то другое - и всё. Считай, что рюкзак благополучно забыт ~"
    "~ Второй вариант напрашивался сам собой - аудитория, где мы проходили викторину ~"
    "~ Там мы провели достаточно много времени - однозначно больше, чем в других аудиториях и ключевых точках. Я безуспешно пытался вспомнить, где мог видеть рюкзак в тот момент, и с досадой отметил, что был слишком поглощен викториной - в памяти остались воспоминания только о ней ~"
    "~ Тем не менее, интуиция подсказывала, что другие варианты можно даже не рассматривать ~"
    "~ Третий вариант - последняя аудитория со стендом ~"
    "~ Я не особо верил в то, что пропажа находится там. Однако помнил, что в этой аудитории Саше внезапно понадобилось поговорить с Ритой и на некоторое время она оставила меня одного ~"
    "~ Очевидно, что во время ее отсутствия могло произойти что угодно - в том числе и потеря рюкзака ~"
    "~ Ну что, мистер Холмс? Попытка только одна. Выбирайте с умом ~"
    menu backpack_is_here:
        char_chapter1_day1_sasha_start_1 "Нам следует вернуться в…"
        #   …”радиоточку”. (Мост к руту Риты)
        #   …аудиторию со стендом-викториной.
        #   …последнюю аудиторию со стендом. (Мост к руту Риты)
        "…”радиоточку”.":
            jump chapter1_day1_rita_bridge
        "…аудиторию со стендом-викториной.":
            jump chapter1_day1_sasha_success
        "…последнюю аудиторию со стендом.":
            jump chapter1_day1_rita_bridge
        
