# Builded with util/parse.py

define char_chapter1_day1_start_0 = Character("Волонтёр")
define char_chapter1_day1_start_1 = Character("Рита")

label chapter1_day1_start:
    scene bus with dissolve
    "~ Я сидел на мягком кресле в изрядно потрепанной дешевой обивке, прислонившись лицом к холодному стеклу дребезжащего окна. Пейзаж за окном, если не фокусировать внимание на деталях, казался статичным. ~"
    "~ Я смотрел на пёстрые крыши иномарок, цветные вывески магазинов и бутиков, разноцветные здания и разноцветных людей ~"
    "~ Странным казалось то, что все эти оттенки в совокупности давали один грязный оттенок серого. Не по-отдельности, но в составе общей картины. Бледное, бесцветное буйство красок ~"
    "~ Я достал телефон из кармана. Глянул на циферблат часов, зашел проверить групповой чат и личку с Андреем, пролистал ленту новостей, включил случайный трек из открытого плейлиста, но почти сразу выключил и спрятал наушники в карман ~"
    "~ Скука и предвкушение полностью поглотили меня. Я снова прислонился к окну ~"
    "~ Казавшееся вязким время, тем не менее, постепенно текло. Спустя полчаса - и месяц по ощущениям - автобус остановился, неуклюже покачнувшись и тяжело вздохнув ~"
    "~ Пассажиры поспешили к выходу и я последовал за ними ~"
    scene guk_2 with dissolve
    "~ Неоднократно в течение всей своей жизни я слышал фразу “лучше увидеть самому”, но сегодня, пожалуй, впервые в этом убедился. Здание главного учебного корпуса выглядело монументально ~"
    "~ Колонны, гипсовые своды, огромный каменный пьедестал у основания - оно не стесняется щеголять своими архитектурными достоинствами ~"
    "~ Впечатляющий вид университета резонно подогрел мой интерес к сегодняшнему мероприятию и слегка приподнял настроение. Я двинулся ко входу, где уже толпились экскурсанты ~"
    "~ Небольшой людской рой жужжал перед импровизированной сценой, на которой суетились человечки в одинаковых синих жилетках и ярких разноцветных кепках ~"
    "~ Волонтеры заполняли какие-то документы, оценивающе разглядывали толпу и, как могло показаться, чего-то ждали ~"
    "~ Я удобно встал с краю толпы, избавив себя от необходимости пробиваться через неё с боем, и перешёл в режим ожидания ~"
    "~ Со сцены послышался скрип рупора. ~"
    char_chapter1_day1_start_0 "Привет, дамы-абитуриенты и господа-абитуриенты! От лица волонтерского состава хочу поблагодарить вас за ожидание и сообщить важную новость: наш вуз - это агломерация нескольких институтов, поэтому экскурсия будет проводиться в группах под каждый из них. Такой подход позволит нам обеспечить максимальный комфорт и понимание тематики экскурсии для каждой группы. Через пару минут на сцену выйдут экскурсоводы с табличками, по которым вы сможете найти интересующую группу. Собирайтесь в колонны по три человека - чур без толкотни! Надеюсь, что мы друг друга поняли!"
    "~ Чур без толкотни - сколько надежды в этих словах! ~"
    "~ ... ~"
    "~ На сцене вдруг возникли несколько гномиков с плакатами _весьма_ внушительных размеров. Смешные буквы на них - названия институтов - ни о чем мне не говорили. ~"
    "~ УГИ, ФТИ, ИРИТ-РТФ, ИнЭУ… и выбрать можно только один! Начало дня - первый судьбоносный выбор ~"
    "~ Только сейчас я задумался о том, что пришел на эту экскурсию, не ожидая увидеть ничего конкретного. Более того - я не планировал изучать институты по-отдельности ~"
    "~ Впрочем, если судить по замешательству в толпе, с похожей мыслью столкнулась половина прибывших. Они гудели, вертелись, но оставались на местах ~"
    "~ Заметив подозрительное шевеление в рое, синие жилеты тоже зашевелились. Спустя минуту со сцены вновь раздался голос: “Всю информацию о институтах вы можете найти на рекламных брошюрках или на сайте университета ~"
    "~ А ведь и правда - что-то похожее я видел на недавно отвоёванном буклете… Неловко ~"
    "~ Среди всех институтов мне симпатизировали только технические, и только один вызывал особый интерес ~"
    "~ Радиотехнический институт был, пожалуй, самым логичным выбором для человека, сдавшего экзамен по информатике. Без лишних предисловий - allons-y ~"
    scene rtf with dissolve
    "~ Мы быстро добрались до здания ИРИТа. Оно не выглядело и на треть столь же помпезно, как главный корпус. ~"
    "~ Но для меня это хороший знак - настоящий храм науки должен воплощать в себе строгость и точность предмета поклонения, а архитектура сохранять сдержанность и практичность, присущую всему научному ~"
    show rita volonteer calm
    "~ У входа экскурсовод решила провести инструктаж ~"
    char_chapter1_day1_start_1 "Итак, ребятки, перед началом хотелось бы представиться и в двух словах обрисовать план предстоящей экскурсии. Меня зовут Рита - я студентка радиофака и в этом году перехожу на второй курс обучения. Сегодня я буду вашим экскурсоводом!"
    char_chapter1_day1_start_1 "*хи-хи*"
    char_chapter1_day1_start_1 "Это, думаю, вы уже и так поняли."
    char_chapter1_day1_start_1 "Что касается экскурсии: союз студентов подготовил для вас небольшое путешествие по ключевым местам института, в ходе которого вы узнаете о светлых эпизодах его истории и перспективах развития."
    char_chapter1_day1_start_1 "Если вдруг заметите у стендов людей в синих кепках со скучающими физиономиями - не стесняйтесь заваливать их вопросами! За охрану экспонатов им всё равно не платят."
    char_chapter1_day1_start_1 "Ах да, и ещё - в конце вас ждет небольшой сюрприз от организаторов. – Рита заговорщически прищурилась и тихо добавила - Уверена, никто кроме нас такого не подготовил."
    "~ Интригующе. Наш экскурсовод, Рита, казалось, горела энтузиазмом, и группа постепенно подхватывала её настрой. ~"
    char_chapter1_day1_start_1 "Все собрались? Все готовы начать?"
    "~ БУ-БУ-БУ - провозгласила толпа. ~"
    char_chapter1_day1_start_1 "Мама-утка вас не расслышала!"
    "~ МЫ ГОТОВЫ - воскликнули экскурсанты. ~"
    char_chapter1_day1_start_1 "Тогда чего мы ждем? Все строем за мной! Наша первая остановка - холл!"
    "~ Рита чуть ли не вприпрыжку ускакала ко входу и мы поскакали вслед за ней. ~"
    "~ Утиная семья просочилась в помещение и быстро растеклась по холлу. Рита перевела дыхание. ~"
    jump chapter1_day1_radik
