# Builded with util/parse.py

define char_chapter2_dayfirst_sasha_seems_end_0 = Character("Саша")
define char_chapter2_dayfirst_sasha_seems_end_1 = Character("ГГ")
define char_chapter2_dayfirst_sasha_seems_end_2 = Character("Мужичок")

label chapter2_dayfirst_sasha_seems_end:
    scene guk_2
    show sasha calm backpack
    "~ Лекция подошла к концу. Саша встала, поправила юбку и подтянула лямку рюкзака. ~"
    char_chapter2_dayfirst_sasha_seems_end_0 "Пойдем дальше?"
    char_chapter2_dayfirst_sasha_seems_end_1 "Куда?"
    char_chapter2_dayfirst_sasha_seems_end_0 "Куда-нибудь. Ничего нового нам тут больше не расскажут."
    "~ Она мило зажмурилась и чихнула. ~"
    char_chapter2_dayfirst_sasha_seems_end_1 "Будь здорова."
    "~ Кивнула в ответ. ~"
    char_chapter2_dayfirst_sasha_seems_end_1 "Позвольте пригласить вас на совместный променад. – я протянул руку Александре."
    char_chapter2_dayfirst_sasha_seems_end_0 "Это была моя идея, дурачок."
    "~ Саша положила ладонь на мою руку и мы пошли куда глаза глядят. Черт, я не ожидал, что она ответит на приглашение… _буквально_. Её мягкая ладонь слегка сжимала мою. При всей естественности происходящего я явственно ощущал напряжение, бурлящее где-то в глубине сознания. Стыдно… ~"
    "~ Целый час мы бродили по тропинкам, огибая кучки людей и высматривая во всем окружающем интересные интересности, пока внимание Саши не привлек баннер у одной из площадок. ~"
    char_chapter2_dayfirst_sasha_seems_end_0 "Леша, смотри… вон, вон там… давай глянем, что тут."
    char_chapter2_dayfirst_sasha_seems_end_1 "Что там написано? Я отсюда не вижу."
    char_chapter2_dayfirst_sasha_seems_end_0 "Боже, просто подойди ближе."
    "~ Эта палатка явно принадлежала главным организаторам мероприятия. Тут повсюду была видна символика вуза, а у небольшой сцены стояла небольшая трибуна. С нее вещал опрятный коренастый мужичок в стильном деловом костюме. ~"
    char_chapter2_dayfirst_sasha_seems_end_2 "…и подводя к основной теме нашего выступления, хочу сообщить вам о проведении конкурса среди талантливых и амбициозных студентов нашего института. В рамках этого масштабного мероприятия мы хотели бы провести конкурс по программированию, который, безусловно, будет интересен и полезен для всех, кто интересуется этой областью."
    "~ Его речь, кажется, загипнотизировала Сашу - та завороженно слушала и не шевелилась. ~"
    char_chapter2_dayfirst_sasha_seems_end_2 "Для вас, уважаемые первокурсники, это будет отличная возможность проявить свои навыки и творческий потенциал, а также продемонстрировать свои достижения в области программирования. Мы верим, что соревнование поможет вам получить ценный опыт и заряд мотивации для дальнейшего профессионального развития. Подробности конкурса, включая тему, условия участия и призы, будут объявлены в ближайшее время."
    "~ Саша зачем-то старалась сохранять невозмутимость - она поджала губы и расправила плечи. Вот только пляшущие огоньки глаз выдавали восторг, который она тщетно старалась скрыть. ~"
    char_chapter2_dayfirst_sasha_seems_end_2 "Мы обязательно учтем различные уровни подготовки и постараемся сделать этот конкурс доступным и интересным для всех желающих. Следите за нашими анонсами и официальными каналами связи, чтобы быть в курсе всех подробностей о конкурсе. – Он развел руки в стороны – Мы ждем вас на нашем мероприятии и надеемся на ваш активный и творческий вклад!"
    "~ Мужчина удалился со сцены под аплодисменты слушателей. Заманчивое предложение, ничего не скажешь. Это оно так привлекло Сашу? ~"
    char_chapter2_dayfirst_sasha_seems_end_1 "Хочешь поучаствовать?"
    "~ Ноль реакции. Я повернулся в сторону Саши… вернее, туда, где она стояла буквально минуту назад. Вот это номер. Она решила бросить меня тут одного? ~"
    char_chapter2_dayfirst_sasha_seems_end_1 "Саша?"
    "~ Ожидаемо, ничего, кроме гула толпы. Я начал всматриваться в силуэты окружающих меня зевак. ~"
    char_chapter2_dayfirst_sasha_seems_end_1 "Ну и где прикажете искать?.. – пробурчал я про себя."
    "~ Целый один знакомый силуэт я разглядел у информационного стенда в глубине палатки. ~"
    "~ Я подошел к Саше и легонько постучал по ее плечу. Саша вздрогнула и жалобно уставилась на меня ~"
    char_chapter2_dayfirst_sasha_seems_end_0 "Ну ты чего пугаешь…"
    char_chapter2_dayfirst_sasha_seems_end_1 "А ты чего бросаешь?"
    char_chapter2_dayfirst_sasha_seems_end_0 "Что значит “бросаю”? – Она растерянно похлопала глазами – Я же предупредила, что буду _тут_."
    char_chapter2_dayfirst_sasha_seems_end_1 " Если ты кого-то и предупредила, то точно не меня. Что тут у тебя такого интересного?"
    char_chapter2_dayfirst_sasha_seems_end_0 "Конкурс… Я _очень_ хочу в нем поучаствовать."
    jump final_message
