# Builded with util/parse.py

label prologue_switch:
    "~ Всё становится на круги своя - не может не радовать. Мы зашли в игру и растворились в ней. Её неспешный, медитативный геймплей буквально убаюкивал. Я был спокоен… в основном. ~"
    "~ Где-то в глубине сознания украдкой делал своё грязное дело червячок сомнения. Ещё недавно суета новоиспеченных абитуриентов забавляла, а их спешка в поисках вуза казалась лишенной смысла ~"
    "~ Теперь же подконтрольность ситуации казалась обманчивой. Ни минуты со дня получения аттестата не было потрачено на поиск университета. ~"
    "~ Пока я беспечно тянул резину, убеждая себя в том, что не шлёпнет, окружающие хлопотали ~"
    "~ Что мы имеем - на фоне их прогресса моё положение выглядит крайне печально, а со временем оно вполне может стать безнадежным. Я мысленно стукнул кулаком по голове ~"
    "~ Чем больше я думал о последствиях своего возможного фиаско, тем отчетливее ощущался запах резины антрацитовых берц, слышался рёв взбешенного комбата и чувствовалась усталость после многочасовых караулов ~"
    "~ Нет, так не пойдет. Пора уж взяться за ум - с завтрашнего дня начну поиски университета ~"
    "~ Завтра. Решено ~"
    jump prologue_searching
