# Builded with util/parse.py

label prologue_end:
    "~ Бросить вызов гладиатору мыши и клавиатуры - как отважно и безрассудно. Я растираю по ладоням пот и кровь поверженного врага, тянусь за наградой. ~"
    "~ Вот он, мой единственный трофей - приглашение посетить день открытых дверей в Уральском федеральном университете ~"
    "~ Едва окинув беглым взглядом его содержание, я принимаю решение пойти туда. Пусть решение кажется несколько поспешным - было предельно очевидно, что я ещё не отошёл от куража битвы - моя уверенность в нем была непоколебима ~"
    "~ Что ж, УрФУ - увидимся через пару недель ~"
    jump chapter1_day1_start
